# BaseDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..BaseDirection Property
TextNode Class See Also
---
Direction of the base line of the text object in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ BaseDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace